#include "param.h"


void LeftBackLegParamInit(LegParam_t *leg_param)
{ 
	leg_param->l0=0.049f;
    leg_param->l1=0.066f;              //电机1旋转平面到电机2旋转中心的距离
    leg_param->d2=-0.108f;              //关节3到关节2的z轴距离
    leg_param->l2=0.227f;              //关节3到关节2的x轴距离
    leg_param->l3=0.246f;              //足端到关节3的距离

    leg_param->m1=0.3f;              //连杆质量
    leg_param->m2=0.8f;
    leg_param->m3=0.5f;

	leg_param->I1<<
		1.0,0.0,0.0,
		0.0,1.0,0.0,
		0.0,0.0,1.0;     //连杆惯性张量
	leg_param->I2<<
		1.0,0.0,0.0,
		0.0,1.0,0.0,
		0.0,0.0,1.0;
	leg_param->I3<<
		1.0,0.0,0.0,
		0.0,1.0,0.0,
		0.0,0.0,1.0;
	leg_param->r1<<0.0f,-0.15f,0.0f;            //质心坐标
	leg_param->r2<<0.0f,0.0f,0.25f;
	leg_param->r3<<0.0f,0.0f,0.25f;
	// leg_param->T_GndToBase<<                    //支撑相中性点到基坐标系的齐次变换矩阵
	// 	0.0     ,0.0    ,-1.0   ,0.115,
	// 	0.0     ,-1.0   ,0.0    ,-0.108,
	// 	-1.0    ,0.0    ,0.0    ,0.32,
	// 	0.0     ,0.0    ,0.0    ,1.0;
	// leg_param->R_GndToBase<<
	// 	0.0     ,0.0    ,-1.0,
	// 	0.0     ,-1.0   ,0.0,
	// 	-1.0    ,0.0    ,0.0;

	leg_param->T_GndToBase<<                    //支撑相中性点到基坐标系的齐次变换矩阵
		0.0     ,0.0    ,-1.0   ,0.115,
		0.0     ,-1.0   ,0.0    ,-0.108,
		-1.0    ,0.0    ,0.0    ,0.32,
		0.0     ,0.0    ,0.0    ,1.0;
	leg_param->R_GndToBase<<
		0.0     ,0.0    ,-1.0,
		0.0     ,-1.0   ,0.0,
		-1.0    ,0.0    ,0.0;
}
